### Terraform Plan Output Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Validation 🤖`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  
  ```terraform

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.backend must be replaced
-/+ resource "azurerm_linux_virtual_machine" "backend" {
      ~ admin_password                                         = (sensitive value) # forces replacement
      ~ admin_username                                         = "adminuser" -> "azureuser" # forces replacement
      ~ computer_name                                          = "rsi-vm-backend" -> (known after apply)
      - encryption_at_host_enabled                             = false -> null
      ~ id                                                     = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Compute/virtualMachines/rsi-vm-backend" -> (known after apply)
        name                                                   = "rsi-vm-backend"
      ~ private_ip_address                                     = "10.1.1.4" -> (known after apply)
      ~ private_ip_addresses                                   = [
          - "10.1.1.4",
        ] -> (known after apply)
      + public_ip_address                                      = (known after apply)
      ~ public_ip_addresses                                    = [] -> (known after apply)
      - secure_boot_enabled                                    = false -> null
        tags                                                   = {
            "Component"   = "Backend"
            "Region"      = "uk south"
            "Terraform"   = "true"
            "environment" = "dev"
        }
      ~ virtual_machine_id                                     = "4a00e508-bba0-41b0-99ae-40d597df6807" -> (known after apply)
      - vtpm_enabled                                           = false -> null
        # (15 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb              = 30 -> (known after apply)
          ~ name                      = "rsi-vm-backend_OsDisk_1_87129d5aee0a453da919e5dbcf94909b" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_virtual_machine_scale_set.rsi-frontend-vmss must be replaced
-/+ resource "azurerm_linux_virtual_machine_scale_set" "rsi-frontend-vmss" {
      ~ admin_password                                    = (sensitive value) # forces replacement
      - encryption_at_host_enabled                        = false -> null
      ~ extension_operations_enabled                      = true -> (known after apply)
      ~ id                                                = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Compute/virtualMachineScaleSets/rsi-vmss-fe" -> (known after apply)
        name                                              = "rsi-vmss-fe"
      ~ platform_fault_domain_count                       = 0 -> (known after apply)
      ~ scale_in_policy                                   = "Default" -> (known after apply)
      - secure_boot_enabled                               = false -> null
      - tags                                              = {} -> null
      ~ unique_id                                         = "743ee84a-3135-46a3-8c7a-12d507c4fcdb" -> (known after apply)
      - vtpm_enabled                                      = false -> null
      - zones                                             = [] -> null
        # (17 unchanged attributes hidden)

      - automatic_instance_repair {
          - enabled      = false -> null
          - grace_period = "PT30M" -> null
        }

      ~ network_interface {
          - dns_servers                   = [] -> null
            name                          = "rsi-fe-nic"
            # (3 unchanged attributes hidden)

          ~ ip_configuration {
              - application_gateway_backend_address_pool_ids = [] -> null
              - application_security_group_ids               = [] -> null
              - load_balancer_inbound_nat_rules_ids          = [] -> null
                name                                         = "internal"
                # (4 unchanged attributes hidden)
            }
        }

      ~ os_disk {
          ~ disk_size_gb              = 30 -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      - scale_in {
          - force_deletion_enabled = false -> null
          - rule                   = "Default" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

  ```
  </details>
  
  *Pusher: @MartyFox, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform Pull Request Plan`*